Repository: 84000/data-translation-memory
Catalog: toh269-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཉན་པའི་ཕྱིར་འཁོར་དེར་འདུས་པར་གྱུར་པའི་སྲོག་ཆགས་སྟོང་ཚང་བ་དེ་དག་ཐམས་ཅད་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གི་དོན་གྱི་སླད་དུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པས་བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་ཕྱོགས་དེ་དག་དང་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཀྱང་མུན་པ་མ་མཆིས་པར་གདའ་ལ།
en: Each of the thousand living beings who had assembled there to listen to this Dharma discourse then rose from their seats, draped their upper robes over one shoulder, knelt on their right knees, bowed toward the Blessed One with palms joined, and spoke these words to the Blessed One: “Blessed One, because the Thus-Gone One taught this Dharma discourse for our benefit, for us, Blessed One, those directions and those world systems appear without darkness.

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་དང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་དཔེར་ན། ད་ལྟར་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པ་འདི་བཞིན་དུ་གདའོ། །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བྱས་ནས།
en: Blessed One, those world systems and those blessed buddhas appear just like the Thus-Gone One teaching the Dharma right now.”

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་རྣམས་ཐོས་ནས་མིག་རྣམ་པར་དག་ཅིང་ཕྱོགས་བཅུ་དག་ན་འཇིག་རྟེན་གྱི་ཁམས་གང་དག་མཆིས་པ་དེ་དག་དང་།
en: Then, by the power of the Buddha, the venerable Śāriputra rose from his seat, draped his upper robe over one shoulder, knelt on his right knee, bowed toward the Blessed One with palms joined, and spoke these words to the Blessed One: “Blessed One, when you taught this Dharma discourse to those noble sons and daughters, having heard the names of those blessed buddhas, their eyes were purified, and they saw all the world systems in the ten directions and all those blessed buddhas.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་མཐོང་བ་དེ་དག་གི་མིག་རྣམ་པར་དག་པའི་བསོད་ནམས་དེ་དག་བཅོམ་ལྡན་འདས་ཅི་ལགས།
en: Blessed One, what is the merit by which they saw that and by which their eyes were purified?

source: ཚེ་རབས་གཞན་དུ་ཚེ་འཕོས་ན་ཡང་འབྲལ་བར་འགྱུར་རམ།
en: Will there still be fruit when they transmigrate to another life?

source: འོན་ཏེ་མི་འགྱུར།
en: Or will there not be?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དག་འདི་ལྟར་མིག་རྣམ་པར་དག་པ་དེ་དག་ནི་སྒྲིབ་པ་མེད་པའི་ཚུལ་གྱིས་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཉིད་དུ་འགྱུར་རོ། །
en: “Śāriputra,” replied the Blessed One, “noble sons and daughters who have correctly entered the Bodhisattva Vehicle and whose eyes have been purified in this way will become exceedingly pure in accordance with their lack of obscurations.

source: ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་སྲོག་ཆགས་སྟོང་ཚང་བ་འདི་མཐོང་ངམ།
en: Śāriputra, do you see all thousand of these living beings?

source: ཤཱ་རིའི་བུ་འདི་དག་ཐམས་ཅད་ནི་སངས་རྒྱས་རྣམས་ཀྱི་མཚན་བཟུང་བའི་དགེ་བའི་རྩ་བ་འདིས་རེ་རེས་ཀྱང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་བྱེད་དུ་བཅུག་ནས་སྲིད་པ་ཐ་མ་དང་།
en: Each and every one of them, Śāriputra, because of the root of virtue of apprehending the names of these buddhas, will attain the life of a universal emperor as many times as there are grains of sand in the Ganges River.

source: ལུས་ཐ་མ་ལ་བྱང་ཆུབ་ཀྱི་ཚོགས་ཐམས་ཅད་རྫོགས་པར་བྱས་ཏེ།
en: In their last life and last body, all these beings will perfect all the accumulations of awakening.

source: བསྐལ་པ་གཅིག་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤྱན་དག་པས་བརྒྱན་པ་ཞེས་བྱ་བར་མཚན་འཐུན་པ་ཤ་སྟག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: In a single eon, every one of them will truly and completely awaken to unsurpassed, completely perfect awakening, all with the name of the thus-gone, worthy, completely perfect Buddha Ornamented with Pure Eyes.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་བུ་དེ་རྣམས་ལུང་བསྟན་པ་བཤད་པ་འདི་བཀའ་སྩལ་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏེ། འགུལ་རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ།
en: As soon as the Blessed One had given his prophecy to those noble sons and daughters, the trichiliocosm shook in six ways: it quaked, quaked deeply, and quaked violently;

source: གཡོས་རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས། འུར་འུར་རབ་ཏུ་འུར་འུར། ཀུན་ཏུ་རབ་ཏུ་འུར་འུར། ལྡེག་རབ་ཏུ་ལྡེག །
en: it shook, shook deeply, and shook violently;

source: ཀུན་ཏུ་རབ་ཏུ་ལྡེག །ཆེམ་ཆེམ་རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ། འཁྲུགས་རབ་ཏུ་འཁྲུགས། ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས་སོ། །
en: and it clamored, clamored deeply, and clamored violently.

source: ས་བླའི་ལྷ་རྣམས་ཀྱིས་ཀྱང་ཀྱེ་མ་གྲོགས་པོ་དག་འདི་ལྟར་རིགས་ཀྱི་བུ་འདི་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་མཚན་བཟུང་བ་ཙམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་བཟུང་ཞིང་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མཁྱེན་པས་དོན་ཐམས་ཅད་ཐུགས་སུ་ཆུད་པའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་བ་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: Even the gods who move above the earth proclaimed, “Friends! It is amazing that by merely apprehending the names of these thus-gone ones these noble sons and daughters will have taken hold of unsurpassed, completely perfect awakening and become thus-gone ones who have understood everything through knowing all phenomena just as they are.

source: སུ་ཞིག་སངས་རྒྱས་ལ་དད་པར་མི་འགྱུར་ཞེས་སྒྲ་བསྒྲགས་སོ། །
en: Who would not then develop faith in the Buddha?”

source: རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སུམ་ཅུ་རྩ་གསུམ་པ་རྣམས་དང་། འཐབ་བྲལ་བ་རྣམས་དང་། དགའ་ལྡན་པ་རྣམས་དང་། འཕྲུལ་དགའ་བ་རྣམས་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་བདུད་ཀྱི་རིས་རྣམས་དང་། ཚངས་རིས་རྣམས་དང་།
en: Having heard the cry of the gods who move above the earth, the gods belonging to the class of the Four Great Kings, those of the Heaven of the Thirty-Three, those of the Heaven Free from Strife, those of the Heaven of Joy, those of the Heaven of Delighting in Emanations, those of the māra class who reside in the Heaven of Making Use of Others’ Emanations, those of the Brahmā Heaven, those of the Heaven of the High Priests of Brahmā, and those of the Heaven of Great Brahmā, up to the gods of the Unexcelled Heaven, were delighted and overjoyed.

source: ཚངས་པའི་མདུན་ན་འདོན་རྣམས་དང་།
en: Having become joyful and happy, they cried, “Friends!

source: ཚངས་པ་ཆེན་པོ་རྣམས་ནས་འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་བར་གྱིས་ས་བླའི་ལྷ་རྣམས་ཀྱིས་སྒྲ་དེ་ཐོས་ནས་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་ལ་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་ཚིག་འདི་སྐད་ཅེས་ཀྱེ་མ་གྲོགས་པོ་དག་འདི་ལྟར་རིགས་ཀྱི་བུ་འདི་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་མཚན་བཟུང་བ་ཙམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་བཟུང་ཞིང་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མཁྱེན་པས་དོན་ཐམས་ཅད་ཐུགས་སུ་ཆུད་པའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་བ་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: It is amazing that in this way, by merely apprehending the names of these thus-gone ones, these noble sons and daughters will have taken hold of unsurpassed, completely perfect awakening and become thus-gone ones who have understood everything through knowing all phenomena just as they are.

source: སུ་ཞིག་སངས་རྒྱས་ལ་དད་པར་མི་འགྱུར་ཞེས་སྨྲས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: Who would not then develop faith in the Buddha?”

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་འཛིན་པར་བྱེད། འཆང་བར་བྱེད། ཀློག་པར་བྱེད། ཀུན་ཆུབ་པར་བྱེད་ཅིང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བྱེད་པ་དང་། ཐ་ན་གླེགས་བམ་ལ་བྲིས་ཏེ་འཆང་བར་བྱེད་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་སངས་རྒྱས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དང་།
en: The Blessed One then said to the venerable Ānanda, “Ānanda, any noble sons or daughters having correctly entered the Bodhisattva Vehicle who hear this Dharma discourse and then remember it, uphold it, read it, master it, correctly teach it widely to others, or even so much as write it down and keep it with them—those noble sons or daughters are blessed by the Buddha.

source: སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Regard them as having served previous victorious ones.

source: དེ་དག་ལ་འཆི་བའི་འཇིགས་པ་མི་འབྱུང་བར་རིག་པར་བྱའོ། །
en: Regard them as those who will not fear death.

source: དེ་དག་གཤིས་ངན་དུ་འཆི་བར་མི་འགྱུར་རོ། །
en: They will not die in a state of distress.

source: དེ་དག་ཕ་རོལ་གྱི་གནོད་པས་འཆི་བར་མི་འགྱུར་རོ། །
en: They will not die from the harms of others.

source: དེ་དག་ལ་ཆུ་དང་། ཆོམ་རྐུན་དང་། དུག་དང་། མཚོན་གྱིས་འཇིགས་པ་མི་འབྱུང་བར་ཡིད་ཆེས་པར་བྱའོ། །
en: Trust that they will not experience fear of water, bandits, poison, or weapons.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསྲུང་བ་ལུང་བསྟན་པ་འདི་ལྟ་བུ་འདི་ཤེས་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བའི་ཕྱིར་ལྷའི་བུ་སྟོང་ཚང་བས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: Then Śakra, lord of the gods, the protector of the bodhisattva great beings, having heard such a prophecy as this, in order to maintain this Dharma discourse, went to where the Blessed One was, surrounded and escorted by a full thousand gods.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་དང་སྲོག་ཆགས་སྟོང་ཚང་བ་གང་དག་བཅོམ་ལྡན་འདས་ཀྱིས་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དེ་དག་ལ་ལྷའི་ཙན་དན་གྱི་ཕྱེ་མ་དང་། ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་།
en: After bowing his head to the feet of the Blessed One and circumambulating the Blessed One three times, he strewed divine sandalwood powder, divine mandārava flowers, and great mandārava flowers toward the Blessed One and all the thousand living beings who had been prophesied by the Blessed One to attain unsurpassed, completely perfect awakening in the future.

source: མན་དཱ་ར་བ་ཆེན་པོ་རྣམས་ཀྱིས་མངོན་པར་གཏོར་ནས་ཐལ་མོ་སྦྱར་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་འདི་སྐད་ཅེས་ཀྱང་གསོལ་ཏོ། །
en: Then, with his palms joined, he sat to one side and spoke these words:

source: བཅོམ་ལྡན་འདས་བདག་གིས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པར་བགྱིད་པ་དང་། འཆང་བར་བགྱིད་པ་དང་། ཀློག་པར་བགྱིད་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དེ་དག་བསྲུང་བར་བགྱིའོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཁྱིམ་ན་མཆིས་སམ། དགོན་པ་ན་མཆིས་སམ།
en: “Blessed One, I will protect any noble sons and daughters who remember this Dharma discourse and who uphold it, read it, and master it.

source: ཤིང་དྲུང་ན་མཆིས་སམ། ཁྱིམ་སྟོང་པ་ན་མཆིས་སམ། འབྲོག་དགོན་པ་ན་མཆིས་སམ། ལམ་དང་ལམ་གོལ་བ་ན་མཆིས་སམ། གཉིད་ལོག་གམ་གཉིད་མ་ལོག་པ་དག་ན་ཡང་དེ་དག་ལ་ཕ་རོལ་གྱི་གནོད་པས་འགུམ་པར་མི་འགྱུར་བར་བདག་གིས་བསྲུང་བར་བགྱིའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: Blessed One, whether those noble sons and daughters are in a house, in a monastery, under a tree, in an empty house, in the remote wilderness, on a path, or astray of a path, whether they are asleep or awakened from sleep, I will protect them so that they will not perish from the harms of others.”

source: ཀུན་དགའ་བོ་ད་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་པ་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཞིག་གིས་ཇི་སྲིད་འཚོའི་བར་དུ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གནས་མལ་དང་། སྙུན་གྱི་གསོས་སྨན་དང་།
en: The Blessed One then said to the venerable Ānanda, “Ānanda, even if some noble sons and daughters were to offer robes, alms, accommodations, medicines for illness, and other necessities throughout the entire life of the thus-gone, worthy, completely perfect Buddha who presently dwells here, alive and well, that alone, Ānanda, would not be paying respect to the Thus-Gone One.

source: ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་བྱེད་ན། ཀུན་དགའ་བོ་དེ་ཙམ་གྱིས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བཀུར་སྟི་བྱས་པར་མི་འགྱུར། བླ་མར་བྱས་པར་མི་འགྱུར། རི་མོར་བྱས་པར་མི་འགྱུར། མཆོད་པ་བྱས་པར་མི་འགྱུར་གྱི།
en: It would not be honoring him, it would not be venerating him, and it would not be offering to him.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་འཛིན་པར་བྱེད་དམ། འཆང་བར་བྱེད་དམ། ཀློག་པར་བྱེད་དམ། ཀུན་ཆུབ་པར་བྱེད་དམ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏམ། ཐ་ན་གླེགས་བམ་ལ་བྲིས་ཏེ་འཆང་ན། ཀུན་དགའ་བོ་དེ་ཙམ་གྱིས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བཀུར་སྟི་དམ་པ་དང་། བླ་མར་བྱ་བ་དམ་པ་དང་། རི་མོར་བྱ་བ་དམ་པ་དང་། མཆོད་པ་དམ་པས་བཀུར་སྟི་བྱས་པ་ཡིན། བླ་མར་བྱས་པ་ཡིན། རི་མོར་བྱས་པ་ཡིན།
en: If any noble sons and daughters who have correctly entered the Bodhisattva Vehicle hear this Dharma discourse and then remember it, uphold it, read it, master it, correctly teach it widely to others, or even so much as write it down and keep it with them, by merely that, Ānanda—through that supreme paying of respect to the Thus-Gone One, that supreme honoring of him, that supreme veneration of him, and that supreme offering to him—it is paying respect to him, honoring him, venerating him, and offering to him.”

source: མཆོད་པ་བྱས་པ་ཡིན་ནོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བྱས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: Then the venerable Ānanda rose from his seat, draped his upper robe over one shoulder, knelt on his right knee, bowed toward the Blessed One with palms joined, and spoke these words to the Blessed One: “Blessed One, what is the name of this Dharma discourse?

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: How should we remember it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཕྱོགས་བཅུའི་མུན་པ་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བར་ཟུང་ཤིག །
en: The Blessed One then replied to the venerable Ānanda, “In this case, Ānanda, remember this Dharma discourse as Dispelling the Darkness of the Ten Directions.

source: འདི་དེ་བཞིན་གཤེགས་པའི་མཚན་ཡང་དག་པར་བརྗོད་པ་ཞེས་བྱ་བ་དང་། དངོས་པོ་མེད་པར་རྟོགས་པ་ཞེས་བྱ་བ་དང་། མཚན་ཉིད་མེད་པར་རྟོགས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་།
en: Remember it also as Reciting the Names of the Thus-Gone Ones, as Realization of Insubstantiality, and as Realization of the Lack of Characteristics.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཤཱཀྱ་གཞོན་ནུ་བཞིན་རབ་གསལ་དང་། སྲོག་ཆགས་སྟོང་ཚང་བ་དེ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། དགེ་སློང་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: The Blessed One having spoken thus, the venerable Ānanda, the venerable Śāriputra, the Śākya youth Shining Countenance, all thousand living beings, the lord of gods Śakra, those monks and bodhisattvas, and the world with its gods, humans, asuras, and gandharvas rejoiced and praised the words of the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །འཕགས་པ་ཕྱོགས་བཅུའི་མུན་པ་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the noble Mahāyāna sūtra “Dispelling the Darkness of the Ten Directions.”

source: རྒྱ་གར་གྱི་མཁན་པོ་བི་ཤུད་དྷ་སིང་ཧ་དང་། ལོཙྪ་བ་བན་དེ་རྩངས་དེ་བེན་དྲ་རཀྵི་ཏས་བསྒྱུར། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཀླུའི་རྒྱལ་མཚན་གྱིས་ཞུ་ཆེན་བགྱིས་ཏེ་གཏན་ལ་ཕབ་པ།​། །​།
en: Translated by the Indian preceptor Viśuddhasiṃha and the translator Bandé Tsang Devendrarakṣita. Edited and finalized by the chief editor and translator Bandé Lui Gyaltsen.
